 tangle을 키친에서 발굴에서 파일명을 적어두고 시간을 기록함.
/emacs/src_tangle.org
비디오명: org_mode_is_awesome.mp4  13:39
(org-babel-tangle) help:org-babel-tangle
- It is bound to C-c C-v t, C-c C-v C-t. 단축키가 있을정도로 이미 완성도가 높다는 의미로 추정됨.

그리고 그 사용법을 기록해서 rust나 c언어의 발굴에 사용하는 링크구조를 만들어서 활용을 높일 것.

- 로딩하는 org파일의 각 원하는 부분을 분리해서 el 파일로 저장하는 것이 :tangle 에 의해 가능할 것이다.
긴 파일명의 경우 quote에 넣어두고 tangle에 대하여 변수값의 형태로 전달하는 것이 가능한지??

# tracking thought process 오그모드를 사용해서! is essential for understanding power!
- 과정과 이유그리고 상세화된 이해력이 요구된다.

* [코드블록분할]C-cC-vC-d:Divide&Conquer방식(src_tangle.org)
#+begin_quote org emacs-lisp C-cC-vC-d(코드블록분할):Divide&Conquer방식(src_tangle.org)
;;quote구조의 org lang으로 실시함
;;C-cC-vC-d(코드블록창설):전체구조목적
   ;:구조를 전체로 : 복사해서 붙인다. 그것을 코드블록분할로 나눈다.
   ;;C-cC-vC-d(코드블록분할):Divide&Conquer방식
   ;;- 등으로 순서를 배치한다음 2칸정도 띄운 다음 실제로 사용할 것을 나눈다.
     ;(test) ;; 전체과정을 기술함. 코드별이동은 C-c C-v n / p / u로 코드부분만을 골라서 이동함.
;; 편집하기 쉬운 구조임 C-c C-v C-x	org-babel-do-key-sequence-in-edit-buffer 전체블록이 탭으로 이동되는 등 연구필요함
;; 연습을 하기 쉬운 구조임 
;; C-c C-v C-v → (이후)C-x C-q(편집모드로 전환해서 자유롭게 발상을 입력해 본다 C-x 1 전체단일화면) → 복귀시에도 원상복구됨! 
   (message "C-cC-vC-d(코드블록분할):Divide&Conquer방식")

 #+begin_src emacs-lisp C-cC-vC-d(코드블록분할):Divide&Conquer방식(src_tangle.org)
;;quote구조의 org lang으로 실시함
;;C-cC-vC-d(코드블록창설):전체구조목적
   ;:구조를 전체로 : 복사해서 붙인다. 그것을 코드블록분할로 나눈다.
   ;;C-cC-vC-d(코드블록분할):Divide&Conquer방식
   ;;- 등으로 순서를 배치한다음 2칸정도 띄운 다음 실제로 사용할 것을 나눈다.
     ;(test) ;; 전체과정을 기술함. 코드별이동은 C-c C-v n / p / u로 코드부분만을 골라서 이동함.
;; 편집하기 쉬운 구조임 C-c C-v C-x	org-babel-do-key-sequence-in-edit-buffer 전체블록이 탭으로 이동되는 등 연구필요함
;; 연습을 하기 쉬운 구조임 
;; C-c C-v C-v → (이후)C-x C-q(편집모드로 전환해서 자유롭게 발상을 입력해 본다 C-x 1 전체단일화면) → 복귀시에도 원상복구됨! 
   (message "C-cC-vC-d(코드블록분할):Divide&Conquer방식")
#+end_src

#+RESULTS:
: C-cC-vC-d(코드블록분할):Divide&Conquer방식

;; 후기 감상: 마치 나를 위해 설계된 것처럼 놀라운 기능의 발견에 감탄! C-c C-v h	org-babel-describe-bindings 주로 살펴서 더 정보를 캐낼 것 아니, 블록을 만들어 보면 어떨까
;; 즉 이전의 모든 것이 연결되는 놀라운 경험을 하는 것 같아 놀랍다!



#+end_quote
#+END_SRC
#+BEGIN_QUOTE text
[[file:/]]



ㅁㅇㄴㄹ
#+BEGIN_SRC sh

echo hi
#+END_SRC

#+RESULTS:
: hi

ㅁㄴㅇㄹ


#+END_QUOTE





*** plask src
#+BEGIN_SRC sh :dir Reporter   :export both
#  cd $HOME/Report 없이 바로 진행됨.
flake8 --exit-zero reporter.py
# property 에서 :dir: Reporter로 작성해도 된다.
#+END_SRC


#+BEGIN_SRC python :tangle Reporter/setup.py
  from setuptools import setuptools
  set(name='Reproter',
      version='1.0',
      description='hHelper instance for dealing with Nagios',
      author='Howard Abrams',
      author_email='howard.abrams@gmail.com'
      py_modulse=['reporter'])
#+END_SRC


#+BEGIN_SRC sh :dir ../  :results table :export both
  #  cd $HOME/Report 없이 바로 진행됨.
  ls | grep "read"
  #echo -c "1\na \n"
  printf "a\na\n"
  pwd
  #flake8 --exit-zero reporter.py
  # property 에서 :dir: Reporter로 작성해도 된다.
#+END_SRC

#+RESULTS:
| _2_app_readme.org                |
| readme.org                       |
| readme.org~                      |
| a                                |
| a                                |
| /home/thinkpad/config_github/app |
